Repository: YspritanHyzygy/Verto
Catalog: Verto/Localizable.xcstrings
Source language: zh_hans
Languages: en, es, ja, ko

source: OCR 测试 · %@
en: OCR Test · %@
es: Prueba OCR · %@
ja: OCR テスト · %@
ko: OCR 테스트 · %@

source: OCR 测试 · Vision
en: OCR Test · Vision
es: Prueba OCR · Vision
ja: OCR テスト · Vision
ko: OCR 테스트 · Vision

source: OCR 测试 · Vision（%@下载中）
en: OCR Test · Vision (%@ downloading)
es: Prueba OCR · Vision (descargando %@)
ja: OCR テスト · Vision（%@をダウンロード中）
ko: OCR 테스트 · Vision(%@ 다운로드 중)

source: OCR 测试 · 自动→%@
en: OCR Test · Auto→%@
es: Prueba OCR · Automático→%@
ja: OCR テスト · 自動→%@
ko: OCR 테스트 · 자동→%@

source: 始终使用系统文字识别
en: Always use system text recognition
es: Usar siempre el reconocimiento de texto del sistema
ja: 常にシステムの文字認識を使用
ko: 항상 시스템 텍스트 인식 사용

source: 按设备和语言使用生产路由
en: Use production routing for this device and language
es: Usar la ruta de producción para este dispositivo e idioma
ja: 端末と言語に応じた本番ルートを使用
ko: 기기와 언어에 맞는 프로덕션 경로 사용

source: 自动
en: Automatic
es: Automático
ja: 自動
ko: 자동

source: “%@” 的自然译文
en: A natural translation of “%@”
es: Una traducción natural de «%@»
ja: 「%@」の自然な翻訳
ko: “%@”의 자연스러운 번역

source: 「%@」の自然な翻訳
en: A natural translation of “%@”
es: Una traducción natural de «%@»
ko: “%@”의 자연스러운 번역

source: %@ · 已检测
en: %@ · Detected
es: %@ · Detectado
ja: %@ · 検出済み
ko: %@ · 감지됨

source: %@ (更简洁)
en: %@ (more concise)
es: %@ (más conciso)
ja: %@（より簡潔）
ko: %@ (더 간결함)

source: %@ (更自然)
en: %@ (more natural)
es: %@ (más natural)
ja: %@（より自然）
ko: %@ (더 자연스러움)

source: %@到%@
en: %@ to %@
es: De %@ a %@
ja: %@から%@へ
ko: %@에서 %@(으)로

source: %lld 字
en: %lld characters
es: %lld caracteres
ja: %lld文字
ko: %lld자

source: LLM 翻译
en: LLM translation
es: Traducción con LLM
ja: LLM 翻訳
ko: LLM 번역

source: 上下轻扫调整变焦倍率
en: Swipe up or down to adjust zoom
es: Desliza hacia arriba o abajo para ajustar el zoom
ja: 上下にスワイプしてズームを調整
ko: 위아래로 쓸어 확대를 조절합니다

source: 下载模型
en: Download model
es: Descargar modelo
ja: モデルをダウンロード
ko: 모델 다운로드

source: 不自动播放语音
en: Never plays audio automatically
es: No reproduce audio automáticamente
ja: 音声を自動再生しません
ko: 음성을 자동으로 재생하지 않습니다

source: 与系统外观保持一致
en: Follows the system appearance
es: Sigue la apariencia del sistema
ja: システムの外観に合わせます
ko: 시스템 외관과 일치시킵니다

source: 中转未返回错误详情
en: The relay returned no error details.
es: El relay no devolvió detalles del error.
ja: 中継サーバーからエラーの詳細が返されませんでした。
ko: 중계 서버가 오류 세부 정보를 반환하지 않았습니다.

source: 交换语言
en: Swap languages
es: Intercambiar idiomas
ja: 言語を入れ替える
ko: 언어 바꾸기

source: 仅戴耳机时朗读
en: Speak only with headphones
es: Leer solo con auriculares
ja: ヘッドフォン接続時のみ読み上げ
ko: 헤드폰 연결 시에만 읽기

source: 仅显示文字
en: Text only
es: Solo texto
ja: テキストのみ
ko: 텍스트만

source: 今天
en: Today
es: Hoy
ja: 今日
ko: 오늘

source: 从相册选择照片
en: Choose a photo from your library
es: Elegir una foto de la fototeca
ja: フォトライブラリから写真を選択
ko: 사진 보관함에서 사진 선택

source: 使用%@讲话
en: Speak in %@
es: Hablar en %@
ja: %@で話す
ko: %@로 말하기

source: 全部
en: All
es: Todo
ja: すべて
ko: 전체

source: 全部语言
en: All languages
es: Todos los idiomas
ja: すべての言語
ko: 모든 언어

source: 关闭
en: Close
es: Cerrar
ja: 閉じる
ko: 닫기

source: 关闭设置
en: Close settings
es: Cerrar ajustes
ja: 設定を閉じる
ko: 설정 닫기

source: 关闭语言选择
en: Close language picker
es: Cerrar el selector de idioma
ja: 言語選択を閉じる
ko: 언어 선택 닫기

source: 其他译法
en: Other translations
es: Otras traducciones
ja: 他の訳し方
ko: 다른 번역

source: 最近使用
en: Recent
es: Recientes
ja: 最近使用した言語
ko: 최근 사용

source: 最高精度
en: Highest accuracy
es: Máxima precisión
ko: 최고 정확도

source: 分享译文
en: Share the translation
es: Compartir la traducción
ja: 訳文を共有
ko: 번역 공유

source: 删除模型
en: Delete model
es: Eliminar modelo
ja: モデルを削除
ko: 모델 삭제

source: 前往设置
en: Open Settings
es: Ir a Ajustes
ja: 設定を開く
ko: 설정으로 이동

source: 加入收藏
en: Add to favorites
es: Añadir a favoritos
ja: お気に入りに追加
ko: 즐겨찾기에 추가

source: 即将推出
en: Coming soon
es: Próximamente
ja: 近日公開
ko: 출시 예정

source: 历史记录
en: History
es: Historial
ja: 履歴
ko: 기록

source: 原文
en: Original text
es: Texto original
ko: 원문

source: 取消下载
en: Cancel download
es: Cancelar descarga
ja: ダウンロードをキャンセル
ko: 다운로드 취소

source: 取消收藏
en: Remove from favorites
es: Quitar de favoritos
ja: お気に入りから削除
ko: 즐겨찾기 해제

source: 可按语言名称或语言代码搜索
en: Search by language name or code
es: Busca por nombre o código de idioma
ja: 言語名または言語コードで検索できます
ko: 언어 이름이나 코드로 검색할 수 있습니다

source: 在线翻译
en: Online translation
es: Traducción en línea
ja: オンライン翻訳
ko: 온라인 번역

source: 均衡
en: Balanced
es: Equilibrado
ja: バランス
ko: 균형

source: 复制译文
en: Copy the translation
es: Copiar la traducción
ja: 訳文をコピー
ko: 번역 복사

source: 外观
en: Appearance
es: Apariencia
ja: 外観
ko: 화면 모드

source: 始终使用浅色外观
en: Always uses the light appearance
es: Usa siempre la apariencia clara
ja: 常にライト外観を使用します
ko: 항상 라이트 모드를 사용합니다

source: 始终使用深色外观
en: Always uses the dark appearance
es: Usa siempre la apariencia oscura
ja: 常にダーク外観を使用します
ko: 항상 다크 모드를 사용합니다

source: 存储空间不足，请清理后重试
en: Not enough storage. Free up some space and try again.
es: No hay espacio suficiente. Libera espacio e inténtalo de nuevo.
ja: 空き容量が足りません。整理してからもう一度お試しください。
ko: 저장 공간이 부족합니다. 공간을 확보한 후 다시 시도하세요.

source: 存入历史记录
en: Save to history
es: Guardar en el historial
ja: 履歴に保存
ko: 기록에 저장

source: 完成并翻译
en: Done and translate
es: Terminar y traducir
ja: 完了して翻訳
ko: 완료 후 번역

source: 完成翻译后自动播放语音
en: Plays audio when a translation finishes
es: Reproduce el audio al terminar la traducción
ja: 翻訳が完了すると音声を自動再生します
ko: 번역이 끝나면 음성을 자동 재생합니다

source: 对话翻译
en: Conversation
es: Conversación
ja: 会話翻訳
ko: 대화 번역

source: 已下载 %@ · 准确率 %@
en: Downloaded %@ · Accuracy %@
es: Descargado %@ · Precisión %@
ja: ダウンロード済み %@ · 精度 %@
ko: 다운로드됨 %@ · 정확도 %@

source: 已关闭
en: Off
es: Desactivado
ja: オフ
ko: 끔

source: 已取消收藏
en: Removed from favorites
es: Quitado de favoritos
ja: お気に入りから削除しました
ko: 즐겨찾기에서 제거됨

source: 已存入历史记录
en: Saved to history
es: Guardado en el historial
ja: 履歴に保存しました
ko: 기록에 저장했습니다

source: 已开启
en: On
es: Activado
ja: オン
ko: 켬

source: 已收藏
en: Added to favorites
es: Añadido a favoritos
ja: お気に入りに追加しました
ko: 즐겨찾기에 추가됨

source: 已暂停 · 轻点继续
en: Paused · Tap to continue
es: En pausa · Toca para continuar
ja: 一時停止中 · タップで再開
ko: 일시정지됨 · 탭하여 계속

source: 翻译完成
en: Translation complete
es: Traducción completada
ja: 翻訳完了
ko: 번역 완료

source: 翻译完成 · %lld 处可点按查看
en: Translation complete · %lld areas available on tap
es: Traducción completada · %lld zonas disponibles al tocar
ja: 翻訳完了 · タップで確認できる箇所：%lld
ko: 번역 완료 · 탭하여 확인할 수 있는 영역 %lld개

source: 选择起点
en: Selection start
es: Inicio de selección
ja: 選択範囲の開始
ko: 선택 시작

source: 选择终点
en: Selection end
es: Fin de selección
ja: 選択範囲の終了
ko: 선택 끝

source: 已选择
en: Selected
es: Seleccionado
ja: 選択中
ko: 선택됨

source: 开始听写
en: Start dictation
es: Iniciar dictado
ja: 音声入力を開始
ko: 받아쓰기 시작

source: 开始聆听
en: Start listening
es: Empezar a escuchar
ja: 聞き取りを開始
ko: 듣기 시작

source: 开始聆听并实时翻译
en: Starts listening and translating in real time
es: Empieza a escuchar y traducir en tiempo real
ja: 聞き取りを開始してリアルタイムで翻訳します
ko: 듣기를 시작하고 실시간으로 번역합니다

source: 当前变焦：%@ 倍
en: Current zoom: %@×
es: Zoom actual: %@×
ja: 現在のズーム：%@倍
ko: 현재 확대: %@배

source: 此设备无法识别这种语言，请选择其他语言
en: This device can't recognize this language. Choose another language.
es: Este dispositivo no puede reconocer este idioma. Elige otro idioma.
ja: このデバイスではこの言語を認識できません。別の言語を選んでください。
ko: 이 기기에서는 이 언어를 인식할 수 없습니다. 다른 언어를 선택하세요.

source: 德语
en: German
es: Alemán
ja: ドイツ語
ko: 독일어

source: 拍摄并翻译
en: Capture and translate
es: Capturar y traducir
ja: 撮影して翻訳
ko: 촬영 후 번역

source: 拍照失败，请重试
en: Couldn’t take the photo. Please try again.
es: No se pudo tomar la foto. Inténtalo de nuevo.
ja: 撮影に失敗しました。もう一度お試しください。
ko: 사진 촬영에 실패했습니다. 다시 시도해 주세요.

source: 文字识别
en: Text recognition
es: Reconocimiento de texto
ja: 文字認識
ko: 텍스트 인식

source: 默认
en: Default
es: Predeterminado
ja: デフォルト
ko: 기본

source: 提交文字并显示译文
en: Submits the text and shows the translation
es: Envía el texto y muestra la traducción
ja: 入力したテキストを確定して訳文を表示します
ko: 입력한 텍스트를 제출하고 번역문을 표시합니다

source: 搜索语言
en: Search languages
es: Buscar idiomas
ja: 言語を検索
ko: 언어 검색

source: 收藏
en: Favorites
es: Favoritos
ja: お気に入り
ko: 즐겨찾기

source: 收藏译文
en: Add the translation to favorites
es: Añadir la traducción a favoritos
ja: 訳文をお気に入りに追加
ko: 번역을 즐겨찾기에 추가

source: 文字
en: Text
es: Texto
ja: テキスト
ko: 텍스트

source: 文字识别出错，请重试
en: Text recognition failed. Please try again.
es: Error al reconocer el texto. Inténtalo de nuevo.
ja: 文字認識でエラーが発生しました。もう一度お試しください。
ko: 텍스트 인식에 실패했습니다. 다시 시도해 주세요.

source: 文本过长，请缩短后重试
en: Text is too long. Shorten it and try again.
es: El texto es demasiado largo. Acórtalo e inténtalo de nuevo.
ja: テキストが長すぎます。短くして再試行してください。
ko: 텍스트가 너무 깁니다. 줄인 후 다시 시도하세요.

source: 无法解析翻译结果，请重试
en: Couldn't read the translation result. Try again.
es: No se pudo interpretar el resultado de la traducción. Inténtalo de nuevo.
ja: 翻訳結果を解析できませんでした。再試行してください。
ko: 번역 결과를 해석할 수 없습니다. 다시 시도하세요.

source: 日语
en: Japanese
es: Japonés
ja: 日本語
ko: 일본어

source: 昨天
en: Yesterday
es: Ayer
ja: 昨日
ko: 어제

source: 暂停聆听
en: Pause listening
es: Pausar la escucha
ja: 聞き取りを一時停止
ko: 듣기 일시정지

source: 暂无收藏
en: No favorites yet
es: Aún no hay favoritos
ja: お気に入りはまだありません
ko: 즐겨찾기가 없습니다

source: 朗读译文
en: Speak the translation
es: Leer la traducción
ja: 訳文を読み上げる
ko: 번역 읽기

source: 未安装模型时使用系统文字识别。韩语始终使用系统文字识别。
en: System text recognition is used when no model is installed. Korean always uses system text recognition.
es: El reconocimiento de texto del sistema se usa cuando no hay ningún modelo instalado. El coreano siempre usa el reconocimiento del sistema.
ja: モデルがインストールされていない場合は、システムの文字認識を使用します。韓国語は常にシステムの文字認識を使用します。
ko: 설치된 모델이 없으면 시스템 텍스트 인식을 사용합니다. 한국어는 항상 시스템 텍스트 인식을 사용합니다.

source: 未找到语言
en: No languages found
es: No se encontraron idiomas
ja: 言語が見つかりません
ko: 언어를 찾을 수 없습니다

source: 未获得相机权限，请在系统设置中开启
en: Camera access is not allowed. Enable it in Settings.
es: No hay acceso a la cámara. Actívalo en Ajustes.
ja: カメラへのアクセスが許可されていません。設定で有効にしてください。
ko: 카메라 권한이 없습니다. 설정에서 허용해 주세요.

source: 未获得语音识别权限，请在系统设置中开启
en: Speech recognition is not allowed. Enable it in Settings.
es: El reconocimiento de voz no está permitido. Actívalo en Ajustes.
ja: 音声認識が許可されていません。設定で有効にしてください。
ko: 음성 인식 권한이 없습니다. 설정에서 허용해 주세요.

source: 未获得麦克风权限，请在系统设置中开启
en: Microphone access is not allowed. Enable it in Settings.
es: No hay acceso al micrófono. Actívalo en Ajustes.
ja: マイクへのアクセスが許可されていません。設定で有効にしてください。
ko: 마이크 권한이 없습니다. 설정에서 허용해 주세요.

source: 未选择
en: Not selected
es: No seleccionado
ja: 未選択
ko: 선택 안 됨

source: 模型下载失败，请检查网络后重试
en: Model download failed. Check your connection and try again.
es: Error al descargar el modelo. Comprueba tu conexión e inténtalo de nuevo.
ja: モデルのダウンロードに失敗しました。通信環境を確認してもう一度お試しください。
ko: 모델 다운로드에 실패했습니다. 네트워크를 확인한 후 다시 시도하세요.

source: 模型安装失败，请重新下载
en: Model installation failed. Please download it again.
es: Error al instalar el modelo. Descárgalo de nuevo.
ja: モデルのインストールに失敗しました。もう一度ダウンロードしてください。
ko: 모델 설치에 실패했습니다. 다시 다운로드하세요.

source: 模型文件校验未通过，请重新下载
en: The model file failed verification. Please download it again.
es: El archivo del modelo no superó la verificación. Descárgalo de nuevo.
ja: モデルファイルの検証に失敗しました。もう一度ダウンロードしてください。
ko: 모델 파일 검증에 실패했습니다. 다시 다운로드하세요.

source: 模拟器不支持系统翻译
en: The Simulator does not support system translation.
es: El simulador no admite la traducción del sistema.
ja: シミュレータはシステム翻訳に対応していません。
ko: 시뮬레이터는 시스템 번역을 지원하지 않습니다.

source: 模拟器暂不支持这种语言的识别，请在真机上测试
en: The simulator can't recognize this language. Test on a real device.
es: El simulador no puede reconocer este idioma. Pruébalo en un dispositivo real.
ja: シミュレータはこの言語の認識に対応していません。実機でテストしてください。
ko: 시뮬레이터에서는 이 언어를 인식할 수 없습니다. 실기기에서 테스트하세요.

source: 正在下载 %lld%%
en: Downloading %lld%%
es: Descargando %lld%%
ja: ダウンロード中 %lld%%
ko: 다운로드 중 %lld%%

source: 正在下载语言模型 %lld%%
en: Downloading language model %lld%%
es: Descargando modelo de idioma %lld%%
ja: 言語モデルをダウンロード中 %lld%%
ko: 언어 모델 다운로드 중 %lld%%

source: 正在准备语音识别…
en: Preparing speech recognition…
es: Preparando el reconocimiento de voz…
ja: 音声認識を準備中…
ko: 음성 인식 준비 중…

source: 正在听写
en: Dictating
es: Dictando
ja: 音声入力中
ko: 받아쓰는 중

source: 正在听写…
en: Dictating…
es: Dictando…
ja: 音声入力中…
ko: 받아쓰는 중…

source: 正在安装
en: Installing
es: Instalando
ja: インストール中
ko: 설치 중

source: 正在生成译图…
en: Generating translated image…
es: Generando la imagen traducida…
ja: 翻訳画像を生成中…
ko: 번역 이미지를 생성하는 중…

source: 正在拍照…
en: Taking photo…
es: Tomando la foto…
ja: 撮影中…
ko: 사진 촬영 중…

source: 正在朗读
en: Speaking
es: Leyendo en voz alta
ja: 読み上げ中
ko: 읽는 중

source: 正在朗读…
en: Speaking…
es: Leyendo en voz alta…
ja: 読み上げ中…
ko: 읽는 중…

source: 正在翻译…
en: Translating…
es: Traduciendo…
ja: 翻訳中…
ko: 번역 중…

source: 正在聆听 · %@
en: Listening · %@
es: Escuchando · %@
ja: 聞き取り中 · %@
ko: 듣는 중 · %@

source: 正在聆听 · %@ / %@
en: Listening · %@ / %@
es: Escuchando · %@ / %@
ja: 聞き取り中 · %@ / %@
ko: 듣는 중 · %@ / %@

source: 正在识别文字…
en: Recognizing text…
es: Reconociendo texto…
ja: 文字を認識中…
ko: 텍스트 인식 중…

source: 此设备没有可用的相机，请从相册选择照片
en: This device has no camera available. Choose a photo from your library.
es: Este dispositivo no tiene cámara disponible. Elige una foto de la fototeca.
ja: この端末では使えるカメラがありません。ライブラリから写真を選んでください。
ko: 이 기기에는 사용할 수 있는 카메라가 없습니다. 라이브러리에서 사진을 선택하세요.

source: 每句译文完成后自动播放
en: Plays each translation when it's ready
es: Reproduce cada traducción al completarse
ja: 訳文が完成するたびに自動再生します
ko: 번역이 끝날 때마다 자동으로 재생합니다

source: 法语
en: French
es: Francés
ja: フランス語
ko: 프랑스어

source: 浅色
en: Light
es: Claro
ja: ライト
ko: 라이트

source: 深色
en: Dark
es: Oscuro
ja: ダーク
ko: 다크

source: 清空原文
en: Clear the original text
es: Borrar el texto original
ja: 原文を消去
ko: 원문 지우기

source: 清除搜索
en: Clear search
es: Borrar búsqueda
ja: 検索をクリア
ko: 검색 지우기

source: 演示译文模式 · 未连接翻译服务
en: Demo translations · No translation service connected
es: Modo de demostración · Sin servicio de traducción
ja: デモ訳文モード · 翻訳サービス未接続
ko: 데모 번역 모드 · 번역 서비스 미연결

source: 轻点编辑原文
en: Tap to edit the original text
es: Toca para editar el texto original
ja: タップして原文を編集します
ko: 탭하여 원문을 편집합니다

source: 画面里没有找到文字，换个角度再试
en: No text found. Try a different angle.
es: No se encontró texto. Prueba con otro ángulo.
ja: 文字が見つかりませんでした。角度を変えてお試しください。
ko: 텍스트를 찾지 못했습니다. 각도를 바꿔 다시 시도해 보세요.

source: 相机
en: Camera
es: Cámara
ja: カメラ
ko: 카메라

source: 相机取景
en: Camera viewfinder
es: Visor de la cámara
ja: カメラのファインダー
ko: 카메라 뷰파인더

source: 设备端离线翻译
en: On-device · Offline
es: En el dispositivo · Sin conexión
ja: デバイス内 · オフライン
ko: 기기 내 오프라인

source: 简体中文
en: Simplified Chinese
es: Chino simplificado
ja: 簡体字中国語
ko: 중국어 간체

source: 精度越高，模型下载体积越大。
en: Higher accuracy requires a larger model download.
es: Los modelos más precisos requieren una descarga mayor.
ja: 精度が高いモデルほど、ダウンロード容量が大きくなります。
ko: 정확도가 높은 모델일수록 다운로드 용량이 큽니다.

source: 系统翻译
en: System Translation
es: Traducción del sistema
ja: システム翻訳
ko: 시스템 번역

source: 系统翻译不可用：%@
en: System translation is unavailable: %@
es: La traducción del sistema no está disponible: %@
ja: システム翻訳が利用できません：%@
ko: 시스템 번역을 사용할 수 없습니다: %@

source: 系统翻译此刻不可用，请稍后再试
en: System translation is unavailable right now. Please try again later.
es: La traducción del sistema no está disponible ahora. Inténtalo de nuevo más tarde.
ja: システム翻訳は現在利用できません。しばらくしてからもう一度お試しください。
ko: 시스템 번역을 지금 사용할 수 없습니다. 잠시 후 다시 시도해 주세요.

source: 系统翻译需要 iOS 18 或以上
en: System translation requires iOS 18 or later.
es: La traducción del sistema requiere iOS 18 o posterior.
ja: システム翻訳には iOS 18 以降が必要です。
ko: 시스템 번역에는 iOS 18 이상이 필요합니다.

source: 结束当前这句并暂停
en: Finishes the current sentence and pauses
es: Termina la frase actual y pausa
ja: 現在の文を確定して一時停止します
ko: 현재 문장을 끝내고 일시정지합니다

source: 网络连接失败，请检查网络后重试
en: Network connection failed. Check your connection and try again.
es: Falló la conexión de red. Comprueba la conexión e inténtalo de nuevo.
ja: ネットワーク接続に失敗しました。接続を確認して再試行してください。
ko: 네트워크 연결에 실패했습니다. 연결을 확인한 후 다시 시도하세요.

source: 翻译
en: Translate
es: Traducir
ja: 翻訳
ko: 번역

source: 目标语言
en: Target language
es: Idioma de destino
ja: 翻訳先言語
ko: 번역 언어

source: 翻译后自动朗读译文
en: Speak translations automatically
es: Leer las traducciones automáticamente
ja: 翻訳後に訳文を自動読み上げ
ko: 번역 후 자동으로 읽기

source: 翻译失败 · 轻点重试
en: Translation failed · Tap to retry
es: Error de traducción · Toca para reintentar
ja: 翻訳に失敗 · タップで再試行
ko: 번역 실패 · 탭하여 다시 시도

source: 翻译失败，请重试
en: Translation failed. Try again.
es: La traducción falló. Inténtalo de nuevo.
ja: 翻訳に失敗しました。再試行してください。
ko: 번역에 실패했습니다. 다시 시도하세요.

source: 翻译完自动朗读
en: Speak after translating
es: Leer tras traducir
ja: 翻訳後に自動読み上げ
ko: 번역 후 자동 읽기

source: 翻译服务配置有误，请检查中转设置。服务返回：%@
en: The translation service is misconfigured. Check the relay settings. Service response: %@
es: El servicio de traducción está mal configurado. Revisa los ajustes del relay. Respuesta del servicio: %@
ja: 翻訳サービスの設定に問題があります。中継サーバーの設定を確認してください。サービスからの応答：%@
ko: 번역 서비스 설정에 문제가 있습니다. 중계 설정을 확인하세요. 서비스 응답: %@

source: 这份构建的翻译服务令牌无效，请检查中转配置
en: This build's translation service token is invalid. Check the relay configuration.
es: El token del servicio de traducción de esta compilación no es válido. Revisa la configuración del relay.
ja: このビルドの翻訳サービストークンが無効です。中継サーバーの設定を確認してください。
ko: 이 빌드의 번역 서비스 토큰이 유효하지 않습니다. 중계 설정을 확인하세요.

source: 翻译服务暂时不可用（HTTP %lld），请稍后重试
en: Translation service is temporarily unavailable (HTTP %lld). Try again later.
es: El servicio de traducción no está disponible temporalmente (HTTP %lld). Inténtalo de nuevo más tarde.
ja: 翻訳サービスは一時的に利用できません（HTTP %lld）。しばらくしてからもう一度お試しください。
ko: 번역 서비스를 일시적으로 사용할 수 없습니다(HTTP %lld). 잠시 후 다시 시도하세요.

source: 翻译服务
en: Translation service
es: Servicio de traducción
ja: 翻訳サービス
ko: 번역 서비스

source: 源语言
en: Source language
es: Idioma de origen
ja: 翻訳元言語
ko: 원문 언어

source: 自动检测
en: Auto-detect
es: Detección automática
ja: 自動検出
ko: 자동 감지

source: 自动检测出语言后可交换
en: You can swap once the language is detected
es: Podrás intercambiar cuando se detecte el idioma
ja: 言語が検出されると入れ替えられます
ko: 언어가 감지되면 바꿀 수 있습니다

source: 自动识别输入语言
en: Detects the input language automatically
es: Detecta automáticamente el idioma de entrada
ja: 入力言語を自動的に検出します
ko: 입력 언어를 자동으로 인식합니다

source: 使用你自己的 API Key
en: Use your own API key
es: Usa tu propia clave de API
ja: 自分の API キーを使用
ko: 개인 API 키 사용

source: 自研模型
en: In-house model
es: Modelo propio
ja: 独自モデル
ko: 자체 모델

source: 英语
en: English
es: Inglés
ja: 英語
ko: 영어

source: 西班牙语
en: Spanish
es: Español
ja: スペイン語
ko: 스페인어

source: 设置
en: Settings
es: Ajustes
ja: 設定
ko: 설정

source: 识别模型文件损坏，请重新下载
en: The recognition model file is damaged. Please download it again.
es: El archivo del modelo de reconocimiento está dañado. Descárgalo de nuevo.
ja: 認識モデルのファイルが破損しています。もう一度ダウンロードしてください。
ko: 인식 모델 파일이 손상되었습니다. 다시 다운로드하세요.

# %@ · 版本 %@
source: %1$@ · 版本 %2$@
en: %1$@ · Version %2$@
es: %1$@ · Versión %2$@
ja: %1$@ · バージョン %2$@
ko: %1$@ · 버전 %2$@

source: 译文
en: Translation
es: Traducción
ja: 訳文
ko: 번역문

source: 译文会显示在这里
en: The translation will appear here
es: La traducción aparecerá aquí
ja: 訳文はここに表示されます
ko: 번역이 여기에 표시됩니다

source: 译文已复制
en: Translation copied
es: Traducción copiada
ja: 訳文をコピーしました
ko: 번역이 복사되었습니다

source: 译文朗读方式：%@
en: Playback mode: %@
es: Modo de lectura: %@
ja: 訳文の読み上げ方法：%@
ko: 번역 읽기 방식: %@

source: 语言包未安装
en: The language pack is not installed.
es: El paquete de idioma no está instalado.
ja: 言語パックがインストールされていません。
ko: 언어 팩이 설치되지 않았습니다.

source: 语言对不受支持
en: This language pair is not supported.
es: Este par de idiomas no es compatible.
ja: この言語ペアはサポートされていません。
ko: 이 언어 쌍은 지원되지 않습니다.

source: 语言方向
en: Translation direction
es: Dirección de traducción
ja: 翻訳の方向
ko: 번역 방향

source: 语音
en: Voice
es: Voz
ja: 音声
ko: 음성

source: 语音对话
en: Voice conversation
es: Conversación de voz
ja: 音声会話
ko: 음성 대화

source: 语音识别出错，请重试
en: Speech recognition failed. Try again.
es: Falló el reconocimiento de voz. Inténtalo de nuevo.
ja: 音声認識でエラーが発生しました。再試行してください。
ko: 음성 인식에 오류가 발생했습니다. 다시 시도하세요.

source: 语音识别模型未就绪，请联网后重试
en: The speech model isn't ready. Connect to the internet and try again.
es: El modelo de voz no está listo. Conéctate a internet e inténtalo de nuevo.
ja: 音声認識モデルが準備できていません。ネットワークに接続して再試行してください。
ko: 음성 인식 모델이 준비되지 않았습니다. 인터넷에 연결한 후 다시 시도하세요.

source: 请尝试其他名称或语言代码
en: Try another name or language code
es: Prueba con otro nombre o código de idioma
ja: 別の名前または言語コードをお試しください
ko: 다른 이름이나 언어 코드로 시도해 보세요

source: 请求过于频繁，请稍后再试
en: Too many requests. Try again later.
es: Demasiadas solicitudes. Inténtalo de nuevo más tarde.
ja: リクエストが多すぎます。しばらくしてから再試行してください。
ko: 요청이 너무 잦습니다. 잠시 후 다시 시도하세요.

source: 谷歌翻译
en: Google Translate
es: Traductor de Google
ja: Google 翻訳
ko: Google 번역

source: 跟随系统
en: Match system
es: Seguir al sistema
ja: システムに合わせる
ko: 시스템 설정 따르기

source: 轻点开始双语对话
en: Tap to start a bilingual conversation
es: Toca para iniciar una conversación bilingüe
ja: タップしてバイリンガル会話を開始します
ko: 탭하여 이중 언어 대화를 시작합니다

source: 丢弃当前照片并返回取景
en: Discards the current photo and returns to the viewfinder
es: Descarta la foto actual y vuelve al visor
ja: 現在の写真を破棄してファインダーに戻ります
ko: 현재 사진을 버리고 뷰파인더로 돌아갑니다

source: 切换闪光灯状态
en: Toggles the flash
es: Activa o desactiva el flash
ja: フラッシュのオンとオフを切り替えます
ko: 플래시를 켜거나 끕니다

source: 拍摄照片，识别文字并显示译文
en: Captures a photo, recognizes its text, and shows the translation
es: Captura una foto, reconoce el texto y muestra la traducción
ja: 写真を撮影し、文字を認識して訳文を表示します
ko: 사진을 촬영하고 텍스트를 인식해 번역문을 표시합니다

source: 轻点开始对话
en: Tap to start a conversation
es: Toca para iniciar una conversación
ja: タップして会話を開始
ko: 탭하여 대화 시작

source: 轻点查看原文与译文对照
en: Tap to compare the original and the translation
es: Toca para comparar el original y la traducción
ja: タップすると原文と訳文を並べて表示します
ko: 누르면 원문과 번역을 나란히 봅니다

source: 轻点结果可查看其他译法
en: Tap the result to see other translations
es: Toca el resultado para ver otras traducciones
ja: 結果をタップすると他の訳し方を表示します
ko: 결과를 탭하면 다른 번역을 볼 수 있습니다

source: 轻量
en: Lightweight
es: Ligero
ja: 軽量
ko: 경량

source: 轻量模型不含日文假名，日语使用系统文字识别。
en: The lightweight model does not include Japanese kana. Japanese uses system text recognition.
es: El modelo ligero no incluye kana japonés. El japonés usa el reconocimiento de texto del sistema.
ja: 軽量モデルにはかなが含まれないため、日本語はシステムの文字認識を使用します。
ko: 경량 모델에는 일본어 가나가 없습니다. 일본어는 시스템 텍스트 인식을 사용합니다.

source: 载入翻译：%@
en: Load translation: %@
es: Cargar traducción: %@
ja: 翻訳を読み込む：%@
ko: 번역 불러오기: %@

source: 输入完成后，轻点完成并翻译
en: When you're done, tap Done and translate
es: Al terminar, toca Terminar y traducir
ja: 入力が終わったら「完了して翻訳」をタップします
ko: 입력을 마치면 ‘완료 후 번역’을 탭합니다

source: 输入需要翻译的文字
en: Enter text to translate
es: Escribe el texto que quieres traducir
ja: 翻訳するテキストを入力
ko: 번역할 텍스트를 입력하세요

source: 连接耳机时才自动播放
en: Plays automatically only with headphones connected
es: Solo se reproduce automáticamente con auriculares conectados
ja: ヘッドフォン接続時のみ自動再生します
ko: 헤드폰이 연결된 경우에만 자동 재생합니다

source: 设为目标语言
en: Set as the target language
es: Establece como idioma de destino
ja: 翻訳先言語に設定します
ko: 번역 언어로 설정합니다

source: 设为源语言
en: Set as the source language
es: Establece como idioma de origen
ja: 翻訳元言語に設定します
ko: 원문 언어로 설정합니다

source: 选择翻译语言
en: Choose translation languages
es: Elegir idiomas de traducción
ja: 翻訳言語を選択
ko: 번역 언어 선택

source: 选择语言
en: Choose language
es: Elegir idioma
ja: 言語を選択
ko: 언어 선택

source: 通用偏好
en: General
es: General
ja: 一般
ko: 일반

source: 重拍
en: Retake
es: Repetir foto
ja: 撮り直す
ko: 다시 촬영

source: 重试
en: Retry
es: Reintentar
ja: 再試行
ko: 다시 시도

source: 闪光灯
en: Flash
es: Flash
ja: フラッシュ
ko: 플래시

source: 需下载 %@ · 准确率 %@
en: %@ download · Accuracy %@
es: Descarga de %@ · Precisión %@
ja: %@ のダウンロードが必要 · 精度 %@
ko: %@ 다운로드 필요 · 정확도 %@

source: 韩语
en: Korean
es: Coreano
ja: 韓国語
ko: 한국어

source: 麦克风启动失败，请重试
en: Couldn't start the microphone. Try again.
es: No se pudo iniciar el micrófono. Inténtalo de nuevo.
ja: マイクを起動できませんでした。再試行してください。
ko: 마이크를 시작하지 못했습니다. 다시 시도하세요.

source: A natural translation of “%@”
es: Una traducción natural de «%@»
ja: 「%@」の自然な翻訳
ko: “%@”의 자연스러운 번역
